#include <stdio.h>

/*Задача 4.Напишете функцията int binarySearch(int a[], int n, int
x), която получава като първи аргумент началото на масив а,
втория аргумент е дължината на масива, а третия аргумент е
числото, което търсим. Знаем, че масива в който ще търсим
елемента е предварително подреден. Сравняваме тъсения
елемент с елемента в средата на масива. Ако той е по голям от
този в средата търсим елемента от средата до края, ако е помалък го търсим в частта от началото до средата. Това се
повтаря, докато елемента от масива не стане равен с търсения.
Тогава връщаме номера на който се намира елемента в масива
или -1 ако не се съдържа в масива.*/

int binarySearch(int *, int, int);

int main(void)
{
    int arr[] = {1, 2, 4, 5, 7, 9, 11, 13};
    printf("The number is on position: %d", binarySearch(arr, 8, 4));
    return 0;
}

int binarySearch(int *arr, int n, int x)
{
    int index = -1;
    int i;
    int len = n - 1;
    for (i = 0; i <= len; i++)
    {
        index = (i + len) / 2;
        if (x < arr[index])
        {
            len = index + 1;
        }
        else if (x > arr[index])
        {
            i = index + 1;
        }
        else
        {
            return index;
        }
    }
    return index;
}
