#include <stdio.h>

/*Задача 7. Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях*/

int main(void)
{
    int arr[10] = {1, 2, 5, 4, 5, 7, 9, 3, 11, 13};
    int *arrPtr;
    arrPtr = arr;
    /*arrPtr = &arr[0]; това е еквивалентно на горното,поинтерът към масива сочи към адреса на първичт елемент на масива.*/
}