#include <stdio.h>

/*Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.*/

int main(void)
{
    int a;
    int *aPtr;
    printf("Address of a: %p\n", &a);
    aPtr = &a;
    printf("Value of aPtr: %p\n", aPtr);
    printf("Value of a: %d\n", a);
    printf("Value of *aPtr: %d\n", *aPtr);
    return 0;
}