#include<stdio.h>

/*Задача 18 Довършете задачата за кемперите от миналия път като добавите
променлива, в която да се събират парите, които клиента дължи на компанията.
Принтирайте резултата. Питайте клиента дали иска още налични продукти.*/
int main(void){
    unsigned char priceKaravani=90;
    unsigned char priceKemper=100;
    unsigned char countKaravani=3;
    unsigned char countKemperi=3;
     printf("Dobre doshli v Karavani Kempeti pod naem\n");
     printf("Ako zelaete karavana natisnete 1\n");
     printf("Ako zelaete kemper natisnete 2\n");
     int rez; 
     scanf("%d", &rez);
}